---
type: CustomFieldData
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# CustomFieldData

`Autodesk.Revit.DB.CustomFieldData` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetCustomFieldId | 2024 | `public Guid GetCustomFieldId ()` |
| Method | GetCustomFieldProperties | 2024 | `public ICustomFieldProperties GetCustomFieldProperties ()` |
| Method | SetCustomFieldProperties | 2024 | `public void SetCustomFieldProperties ( ICustomFieldProperties customFieldProperties )` |
| Method | ValidateCustomFieldProperties | 2024 | `public string ValidateCustomFieldProperties ( ICustomFieldProperties customFieldProperties )` |
| Property | DefaultRowHeightOnSheet | 2024 | `public double DefaultRowHeightOnSheet { get ; }` |
| Property | FieldName | 2024 | `public string FieldName { get ; }` |
| Property | FieldTooltip | 2024 | `public string FieldTooltip { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |